app/controllers/comments_controller.rb

		def index
			@post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)

		def show
			@post = Post.find(params[:post_id])
			@comment = @post.comments.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 6)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 6))

		def new
			@post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)

		def create
			@post = Post.find(params[:post_id])
			@comment = @post.comments.build(params[:comment])

			if @comment.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
INSERT INTO `comments` (`updated_at`, `post_id`, `body`, `commenter`, `created_at`) VALUES('2014-11-07 09:28:36', 2, 'test comment', 'hai', '2014-11-07 09:28:36')

		def edit
			@post = Post.find(params[:post_id])
			@comment = @post.comments.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 6)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 6))