app/controllers/posts_controller.rb

  def index
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def new
    @user=User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `user_id`, `title`, `created_at`, `content`, `updated_at`) VALUES('new oi=ost', NULL, 'new post test', '2014-11-10 11:27:20', 'sawdw', '2014-11-10 11:27:20')

  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE `posts` SET `updated_at` = '2014-11-07 05:48:33', `content` = 'hai how are u itxz updates' WHERE `id` = 2

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `id` = 1

    def find_post

        @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.user_id = 2)